## Project Objective / Business Relevance

The aim of this project is to group bank customers using their transaction behaviour. This will be done using RFM analysis which is a powerful method to quantify behaviour using the following criteria:
- Recency: how recent a customer has made a purchase
- Frequency: how frequently a customer makes purchases
- Monetary: how much money a customer spends

The results of this project are extremely useful from a marketing perspective to tailer targeted marketing strategies based on customer behaviour to guide promotional content.

In [77]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [78]:
# pd.set_option("display.max_rows", None)
# pd.set_option("display.max_columns", None)
# pd.reset_option("display.max_rows")
# pd.reset_option("display.max_columns")

## Importing and Cleaning Data

The bank_transactions dataset was taken from kaggle at https://www.kaggle.com/datasets/shivamb/bank-customer-segmentation. The dataset contains over 1 million transactions from an Indian Bank.

In [79]:
# Importing bank transactions data
bank_df = pd.read_csv('bank_transactions.csv')
bank_df

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T1,C5841053,10/1/94,F,JAMSHEDPUR,17819.05,2/8/16,143207,25.0
1,T2,C2142763,4/4/57,M,JHAJJAR,2270.69,2/8/16,141858,27999.0
2,T3,C4417068,26/11/96,F,MUMBAI,17874.44,2/8/16,142712,459.0
3,T4,C5342380,14/9/73,F,MUMBAI,866503.21,2/8/16,142714,2060.0
4,T5,C9031234,24/3/88,F,NAVI MUMBAI,6714.43,2/8/16,181156,1762.5
...,...,...,...,...,...,...,...,...,...
1048562,T1048563,C8020229,8/4/90,M,NEW DELHI,7635.19,18/9/16,184824,799.0
1048563,T1048564,C6459278,20/2/92,M,NASHIK,27311.42,18/9/16,183734,460.0
1048564,T1048565,C6412354,18/5/89,M,HYDERABAD,221757.06,18/9/16,183313,770.0
1048565,T1048566,C6420483,30/8/78,M,VISAKHAPATNAM,10117.87,18/9/16,184706,1000.0
1048566,T1048567,C8337524,5/3/84,M,PUNE,75734.42,18/9/16,181222,1166.0

First the columns that would be used for demographic segmentation but are not of interest to us are removed. In addition, the account balance and the transaction time will not be used. Only the transaction date will be used for recency as the number of days since the last transaction is sufficient information for recency criteria.

In [80]:
# Dropping columns that won't be used
bank_df = bank_df.drop(['CustomerDOB', 'CustGender', 'CustLocation', 'CustAccountBalance', 'TransactionTime'], axis=1)
bank_df

        TransactionID CustomerID TransactionDate  TransactionAmount (INR)
0                  T1   C5841053          2/8/16                     25.0
1                  T2   C2142763          2/8/16                  27999.0
2                  T3   C4417068          2/8/16                    459.0
3                  T4   C5342380          2/8/16                   2060.0
4                  T5   C9031234          2/8/16                   1762.5
...               ...        ...             ...                      ...
1048562      T1048563   C8020229         18/9/16                    799.0
1048563      T1048564   C6459278         18/9/16                    460.0
1048564      T1048565   C6412354         18/9/16                    770.0
1048565      T1048566   C6420483         18/9/16                   1000.0
1048566      T1048567   C8337524         18/9/16                   1166.0

[1048567 rows x 4 columns]

In [81]:
# Checking for missing values
bank_df.isna().sum()

TransactionID              0
CustomerID                 0
TransactionDate            0
TransactionAmount (INR)    0
dtype: int64

There are no missing values in the remaining columns.

In [82]:
# Showing column data types
bank_df.dtypes

TransactionID               object
CustomerID                  object
TransactionDate             object
TransactionAmount (INR)    float64
dtype: object

In [83]:
# Displaying number of unique dates in dataset
bank_df['TransactionDate'].unique()

array(['2/8/16', '1/8/16', '3/8/16', '5/8/16', '4/8/16', '6/8/16',
       '9/8/16', '8/8/16', '12/8/16', '7/8/16', '21/10/16', '16/10/16',
       '10/8/16', '14/8/16', '17/8/16', '21/8/16', '19/8/16', '24/8/16',
       '22/8/16', '29/8/16', '31/8/16', '22/9/16', '23/9/16', '13/8/16',
       '25/8/16', '28/8/16', '15/8/16', '27/8/16', '20/8/16', '23/8/16',
       '30/8/16', '11/8/16', '16/8/16', '26/8/16', '27/9/16', '18/8/16',
       '25/9/16', '26/9/16', '30/9/16', '3/9/16', '2/9/16', '1/9/16',
       '6/9/16', '5/9/16', '4/9/16', '9/9/16', '8/9/16', '7/9/16',
       '12/9/16', '11/9/16', '10/9/16', '15/9/16', '14/9/16', '13/9/16',
       '18/9/16'], dtype=object)

From the date entries it is clear that the dates are spread out over 3 months in 2016 (Aug, Sep, Oct) so the format is day/month/year.

In [84]:
# Converting TransactionDate type to DateTime
from datetime import date
bank_df['TransactionDate'] = pd.to_datetime(bank_df['TransactionDate'], format="%d/%m/%y")
bank_df['TransactionDate']

0         2016-08-02
1         2016-08-02
2         2016-08-02
3         2016-08-02
4         2016-08-02
             ...
1048562   2016-09-18
1048563   2016-09-18
1048564   2016-09-18
1048565   2016-09-18
1048566   2016-09-18
Name: TransactionDate, Length: 1048567, dtype: datetime64[ns]

We would convert the transaction amount values from Indian Rupees (INR) to CAD or USD. However, general prices in india likely don't convert the same way currency does. So the amounts will be kept in INR for now.

In [87]:
bank_df.describe()

                     TransactionDate  TransactionAmount (INR)
count                        1048567             1.048567e+06
mean   2016-08-25 04:33:33.797497600             1.574335e+03
min              2016-08-01 00:00:00             0.000000e+00
25%              2016-08-12 00:00:00             1.610000e+02
50%              2016-08-25 00:00:00             4.590300e+02
75%              2016-09-06 00:00:00             1.200000e+03
max              2016-10-21 00:00:00             1.560035e+06
std                              NaN             6.574743e+03

In [90]:
# Determining outliers
Q1 = bank_df['TransactionAmount (INR)'].quantile(0.25)
Q3 = bank_df['TransactionAmount (INR)'].quantile(0.75)
IQR = Q3 - Q1
outliers_filter = (bank_df['TransactionAmount (INR)'] < (Q1 - 1.5 * IQR)) | (bank_df['TransactionAmount (INR)'] > (Q3 + 1.5 * IQR))
outliers = bank_df[outliers_filter]
outliers['TransactionAmount (INR)'].unique()
print(f"There are {len(outliers)} outliers.")

There are 112134 outliers.

Because transaction amounts can very significantly there is a large variation in the values in this column. The IQR outlier method determines there are 112134 outliers in this dataset (which is roughly a tenth of the dataset). These are likely actual transactions from clients spending large sums of money instead of erros in data collection. These outliers will therefore be kept.